model_openfoam/tests/steadyToyProblem/stochModel/model/0/p_rgh
/*--------------------------------*4D-COOL*----------------------------------*\
|------------------------------OpenFOAM v 1712 -------------------------------|
\*--------------------------------*4D-COOL*----------------------------------*/
FoamFile
{
version    2.0;
format     ascii;
class      volScalarField;
object     p_rgh;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0;

boundaryField
{
    ".*"
    {
        type            fixedFluxPressure;
        value           uniform 0;
    }
"tileX0Y0.*"
{
    type         porousBafflePressure;
    patchType    cyclic;
    jump         uniform 0;
    D            0;
    I            214.25;
    length       0.01;
    value        uniform 0;
}
"tileX1Y1.*"
{
    type         porousBafflePressure;
    patchType    cyclic;
    jump         uniform 0;
    D            0;
    I            428.5;
    length       0.01;
    value        uniform 0;
}
"tileX2Y0.*"
{
    type         porousBafflePressure;
    patchType    cyclic;
    jump         uniform 0;
    D            0;
    I            214.25;
    length       0.01;
    value        uniform 0;
}
"tileX3Y0.*"
{
    type         porousBafflePressure;
    patchType    cyclic;
    jump         uniform 0;
    D            0;
    I            214.25;
    length       0.01;
    value        uniform 0;
}
    CRAC_Return
    {
        type            totalPressure;
        p0              uniform 0;
        gamma           1.4;
        value           $internalField;
        rho             rhok;
    }
    "openNatural.*"
    {
        type            totalPressure;
        p0              uniform 0.0;
        value           $internalField;
    }
    "openRoof.*"
    {
        type            totalPressure;
        p0              uniform 0;
        value           $internalField;
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
