model_openfoam/tests/steadyToyProblem/stochModel/model/0/alphat
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      alphat;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -1 0 0 0 0 ];

internalField   uniform 0.001;

boundaryField
{
    wall
    {
        type            alphatJayatillekeWallFunction;
        Prt             0.9;
        value           $internalField;
    }
    cyclic
    {
        type            cyclic;
        value           $internalField;
    }
    "CRAC.*"
    {
        type            calculated;
        value           $internalField;
    }
}


// ************************************************************************* //
