model_openfoam/tests/steadyToyProblem/stochModel/model/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1712                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [ 0 2 -2 0 0 0 0 ];

internalField   uniform 0.06;

boundaryField
{
    wall//".*"
    {
        type            kqRWallFunction;
        value           $internalField;
    }
    cyclic
    {
        type            cyclic;
        value           $internalField;
    }
    CRAC_Return
    {
        type            inletOutlet;
        inletValue      $internalField;// tbd
        value           $internalField;
    }
    CRAC_Supply
    {
        type            turbulentIntensityKineticEnergyInlet;
        value           $internalField;
        intensity       0.1;
    }
}


// ************************************************************************* //
