model_openfoam/tests/steadyToyProblem/stochModel/model/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  2.3.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

ddtSchemes
{
    default             steadyState;// CrankNicolson 0.9;
}

gradSchemes
{
    default             cellLimited leastSquares 1;
    grad(p)             leastSquares;
}

divSchemes
{
    default             none;
    div(phi,U)          bounded Gauss linearUpwind grad(U);  //GammaV 0.2;            bounded 
    div(phi,T)          bounded Gauss linearUpwind grad (T);//Gamma 0.2;              bounded 
    div(phi,k)          bounded Gauss limitedLinear 1.0;// linearUpwind grad(k);      bounded 
    div(phi,omega)      bounded Gauss limitedLinear 1.0;// linearUpwind grad(omega);  bounded 
    div((nuEff*dev2(T(grad(U))))) Gauss linear;
}

laplacianSchemes
{
    default             Gauss linear limited 0.5;//corrected;//limited 0.333;
}

interpolationSchemes
{
    default             linear;
}

snGradSchemes
{
    default             limited 0.5;//corrected;//
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
