model_openfoam/tests/steadyToyProblem/stochModel/model/system/POROUS
/*--------------------------------*4D-COOL*----------------------------------*\
|------------------------------OpenFOAM v 1712 -------------------------------|
\*--------------------------------*4D-COOL*----------------------------------*/
FoamFile
{
version    2.0;
format     ascii;
class      dictionary;
object     POROUS;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

porousX0Y0
{
    type          explicitPorositySource;
    active        true;
    explicitPorositySourceCoeffs
    {
        selectionMode      cellZone;
        cellZone           rackX0Y0;
        type               fixedCoeff;
        active             yes;
        fixedCoeffCoeffs
        {
               alpha       alpha [0 0 -1 0 0 0 0] (0.0 -10.0 -10.0);
               beta        beta [0 -1 0 0 0 0 0] (45.70135 -10.0 -10.0);
               coordinateSystem
               {
                   type    cartesian;
                   origin  (0 0 0);
                   coordinateRotation
                   {
                       type    axesRotation;
                       e1      (1 0 0);
                       e2      (0 1 0);
                   }
               }
        }
    }
}
porousX0Y1
{
    type          explicitPorositySource;
    active        true;
    explicitPorositySourceCoeffs
    {
        selectionMode      cellZone;
        cellZone           rackX0Y1;
        type               fixedCoeff;
        active             yes;
        fixedCoeffCoeffs
        {
               alpha       alpha [0 0 -1 0 0 0 0] (0.0 -10.0 -10.0);
               beta        beta [0 -1 0 0 0 0 0] (7.31222 -10.0 -10.0);
               coordinateSystem
               {
                   type    cartesian;
                   origin  (0 0 0);
                   coordinateRotation
                   {
                       type    axesRotation;
                       e1      (1 0 0);
                       e2      (0 1 0);
                   }
               }
        }
    }
}
porousX1Y0
{
    type          explicitPorositySource;
    active        true;
    explicitPorositySourceCoeffs
    {
        selectionMode      cellZone;
        cellZone           rackX1Y0;
        type               fixedCoeff;
        active             yes;
        fixedCoeffCoeffs
        {
               alpha       alpha [0 0 -1 0 0 0 0] (0.0 -10.0 -10.0);
               beta        beta [0 -1 0 0 0 0 0] (7.31222 -10.0 -10.0);
               coordinateSystem
               {
                   type    cartesian;
                   origin  (0 0 0);
                   coordinateRotation
                   {
                       type    axesRotation;
                       e1      (1 0 0);
                       e2      (0 1 0);
                   }
               }
        }
    }
}
porousX1Y1
{
    type          explicitPorositySource;
    active        true;
    explicitPorositySourceCoeffs
    {
        selectionMode      cellZone;
        cellZone           rackX1Y1;
        type               fixedCoeff;
        active             yes;
        fixedCoeffCoeffs
        {
               alpha       alpha [0 0 -1 0 0 0 0] (0.0 -10.0 -10.0);
               beta        beta [0 -1 0 0 0 0 0] (7.31222 -10.0 -10.0);
               coordinateSystem
               {
                   type    cartesian;
                   origin  (0 0 0);
                   coordinateRotation
                   {
                       type    axesRotation;
                       e1      (1 0 0);
                       e2      (0 1 0);
                   }
               }
        }
    }
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
