model_openfoam/tests/steadyToyProblem/stochModel/model/system/fvOptions
/*--------------------------------*4D-COOL*----------------------------------*\
|------------------------------OpenFOAM v 1712 -------------------------------|
\*--------------------------------*4D-COOL*----------------------------------*/
FoamFile
{
version    2.0;
format     ascii;
class      dictionary;
object     fvOptions;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include "HEATING"
#include "POROUS"


// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
